ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ИндивидуальныеУсловияПоставки/ЖБИ_ИндивидуальныеУсловияПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ИндивидуальныеУсловияПоставки</name>
  <comment>ЖБИ - Индивидуальные условия поставки</comment>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЖБИ_РасчетИндЦен</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Менеджер логист</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Бизнес-регион</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Негабаритный</name>
      <comment>Не габарит</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоставщика</name>
      <comment>Текущая цена поставщика с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>% скидки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦенаПоставщика</name>
      <comment>Новая цена поставщика с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Партнер</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Почта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_РасчетИндЦен/ЖБИ_РасчетИндЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_РасчетИндЦен</name>
  <comment>ЖБИ - Расчет инд. цен поставщика</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидки</name>
    <comment>% скидки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкиПокупателей</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначения</name>
    <comment>Пункт назначения</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ЖБИ_СтатусЗаявкиПокупателя/ЖБИ_СтатусЗаявкиПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖБИ_СтатусЗаявкиПокупателя</name>
  <comment>ЖБИ - Статус заявки покупателя</comment>
  <enumValues>
    <name>Новый</name>
    <comment>Новый</comment>
  </enumValues>
  <enumValues>
    <name>ОтправленНаРасчетПлановыхСтавок</name>
    <comment>Отправлен на расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>РасчетПлановыхСтавок</name>
    <comment>Расчет плановых ставок</comment>
  </enumValues>
  <enumValues>
    <name>ОкончательныйРасчет</name>
    <comment>Окончательный расчет</comment>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЛогистами</name>
    <comment>Подтверждение логистами</comment>
  </enumValues>
  <enumValues>
    <name>ПодготовкаСчета</name>
    <comment>Подготовка счета</comment>
  </enumValues>
  <enumValues>
    <name>ВыпискаДокументов</name>
    <comment>Выписка документов</comment>
  </enumValues>
  <enumValues>
    <name>ВОтгрузке</name>
    <comment>В отгрузке</comment>
  </enumValues>
  <enumValues>
    <name>ИстекСрокДействия</name>
    <comment>Истек срок действия</comment>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
    <comment>Отгружено</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
    <comment>Завершен</comment>
  </enumValues>
  <enumValues>
    <name>ВАрхиве</name>
    <comment>В архиве</comment>
  </enumValues>
  <enumValues>
    <name>Удален</name>
    <comment>Удален</comment>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ИндивидуальныеУсловияПоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ИзменитьСтатусИндивидуальныхЦенПоставщика(СсылкаЗаявка,СсылкаИндЦен,СообщениеОбОшибки) Экспорт 
	
	Отказ = Ложь;
	ОбъекЗаявка = СсылкаЗаявка.ПолучитьОбъект();
	Если ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.Новый
		ИЛИ ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОтправленНаРасчетПлановыхСтавок Тогда 
		ИмяТаблицы = "ПредварительныйРасчет";
	Иначе 
		ИмяТаблицы = "ОкончательныйРасчет";
	КонецЕсли;
	Для Каждого НомСтр Из СсылкаИндЦен.Товары Цикл
		СтруктураОтбор = Новый Структура("ИндивидуальнаяЦена,КодСтроки,Номенклатура,НоменклатураПоставщика,Негабаритный,Поставщик",Истина,НомСтр.КодСтроки,НомСтр.Номенклатура,НомСтр.НоменклатураПоставщика,НомСтр.Негабаритный,СсылкаИндЦен.Партнер);
		НайденныеСтроки = ОбъекЗаявка[ИмяТаблицы].НайтиСтроки(СтруктураОтбор);
		Для Каждого Ном Из НайденныеСтроки Цикл 
			Ном.ИндивидуальнаяЦена = Ложь;
			Ном.ЦенаПоставщика = НомСтр.НоваяЦенаПоставщика;
		КонецЦикла;
	КонецЦикла;
	
	ТаблРасчет 		= ОбъекЗаявка[ИмяТаблицы].Выгрузить();
	ТаблицаКонтроль = ОбъекЗаявка.КонтрольТранспорта.Выгрузить();
	//ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(СсылкаЗаявка,ТаблРасчет,ТаблицаКонтроль,Истина);
	//ОбъекЗаявка[ИмяТаблицы].Загрузить(ТаблРасчет);
	
	СтатусЗавершен = Документы.ЖБИ_ЗаявкиПокупателей.МожноПереводитьДокументНаОкончательныйРасчет(СсылкаЗаявка, СсылкаИндЦен);
	Если СтатусЗавершен 
		И СсылкаЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОтправленНаРасчетПлановыхСтавок Тогда 
		ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОкончательныйРасчет;
		Документы.ЖБИ_ЗаявкиПокупателей.ЗаполнитьТаблицуОкончательныйРасчет(ОбъекЗаявка,ОбъекЗаявка.ПредварительныйРасчет.Выгрузить(Новый Структура("Пометка",Истина)));
	КонецЕсли;
	
	Попытка
		ОбъекЗаявка.Записать();
	Исключение
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;
		Возврат Отказ;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция ВыполнитьКомандуРасчетИндЦен(Ссылка,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	Товары = Ссылка.Товары;
		
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_РасчетИндЦен.ПолучитьПустуюТаблицуНаборЗаписей();
	Для Каждого НомСтр Из Товары Цикл 
		НоваяСтр 						= ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Регистратор 			= Ссылка;
		НоваяСтр.Период					= Ссылка.Дата;
		НоваяСтр.Активность				= Истина;
		НоваяСтр.КодСтроки				= НомСтр.КодСтроки;
		НоваяСтр.Номенклатура			= НомСтр.Номенклатура;
		НоваяСтр.НоменклатураПоставщика	= НомСтр.НоменклатураПоставщика;
		НоваяСтр.ЗаявкиПокупателей		= Ссылка.ДокументОснование;
		НоваяСтр.Поставщик				= Ссылка.Партнер;
		НоваяСтр.ПунктНазначения		= Ссылка.ДокументОснование.ПунктНазначения;
		НоваяСтр.Цена					= НомСтр.НоваяЦенаПоставщика;
		НоваяСтр.ПроцентСкидки			= НомСтр.ПроцентСкидки;
		НоваяСтр.Количество				= НомСтр.Количество;
		НоваяСтр.Негабаритный			= НомСтр.Негабаритный;
		НоваяСтр.Автор					= Пользователи.ТекущийПользователь();
	КонецЦикла;
	
	//Делаем запись в регистр	
	Результат = РегистрыСведений.ЖБИ_РасчетИндЦен.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибке);
	Если Не Результат Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

&Перед("ДобавитьКомандыПечати")
Процедура ЖБИ_ДобавитьКомандыПечати(КомандыПечати)
	
	//ЖБИ_ЗаявкаПоставщику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_ЗаявкаПоставщику";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - Заявка поставщику'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_ЗаявкаПоставщикуКратко";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - Заявка поставщику кратко'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		
КонецПроцедуры

//&Перед("Печать")
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм = Неопределено) Экспорт
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ЗаявкаПоставщику");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - Заявка поставщику'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ЗаявкаПоставщику",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
		Если МассивПечатныхФорм <> Неопределено Тогда 
			МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
		КонецЕсли;	
	КонецЕсли;
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ЗаявкаПоставщикуКратко");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - Заявка поставщику кратко'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ЗаявкаПоставщикуКратко",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
		Если МассивПечатныхФорм <> Неопределено Тогда 
			МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры

Функция ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗАЯВКАПОСТАВШИКУ";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументЗаявкаПоставщикуИндЦены(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗАЯВКАПОСТАВШИКУКРАТКО";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументЗаявкаПоставщикуИндЦеныКратко(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецЕсли
